Documents/ДивидентыПолученные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДивидентыПолученные</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетАкций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дивиденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дивидент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоАкций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДивидентов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НДФЛСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДФЛ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДивидентыПолученные/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы
            &НаКлиенте
Процедура ДивидентыДивидентПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.СуммаДивидентов 	= СтрокаРасчета.Дивидент * СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;

	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
	КонецПроцедуры

&НаКлиенте
Процедура ДивидентыКоличествоАкцийПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.СуммаДивидентов 	= СтрокаРасчета.Дивидент * СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
КонецПроцедуры

&НаКлиенте
Процедура ДивидентыСуммаДивидентовПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.Дивидент 			= СтрокаРасчета.СуммаДивидентов/СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;

КонецПроцедуры

&НаКлиенте
Процедура ДивидентыСтавкаНДФЛПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
КонецПроцедуры 



 &НаСервере
 Функция ПолучитьСтавкуНДФЛСервер(Ставка) Экспорт
	 
	 СтавкаНДФЛЧисло 				= СлужебныйПолучитьСтавкуНДФЛ.ПолучитьСтавкуНДФЛ(Ставка);
	 
	 Возврат  СтавкаНДФЛЧисло;
 КонецФункции //ПолучитьСтавкуНДФЛС ()

&НаКлиенте
 Процедура ДивидентыСуммаНДФЛПриИзменении(Элемент)
	 СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	 СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
 КонецПроцедуры
 

 


#КонецОбласти
